/* -*- Mode: C; tab-width: 4; indent-tabs-mode: nil; c-basic-offset: 4 -*- */
/*
 * swi-update -- Command line tool to update QMI firmware
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 *
 * Copyright (C) Copyright 2016 Bjørn Mork <bjorn@mork.no>
 *
 * crc16 and hdlc parts:
 *   Copyright (C) 2010 Red Hat, Inc.
 *
 * parts of this is based on gobi-loader, which is
 *
 *  "Copyright 2009 Red Hat <mjg@redhat.com> - heavily based on work done by
 *   Alexander Shumakovitch <shurik@gwu.edu>
 *
 *   Gobi 2000 support provided by Anssi Hannula <anssi.hannula@iki.fi>"
 */

#include <endian.h>
#include <errno.h>
#include <fcntl.h>
#include <getopt.h>
#include <limits.h>
#include <linux/types.h>
#include <malloc.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/stat.h>
#include <sys/select.h>
#include <termios.h>
#include <unistd.h>

/* FIXME: endianness - this works on LE for now... */

#ifndef VERSION
  #define VERSION "unknown"
#endif
#define DESCRIPTION "swi-update (" VERSION ")"

#ifdef DEBUG
static bool debug;
#define debug(arg...) if (debug) fprintf(stderr, arg)
static void print_packet(const char *pfx, void *buf, int len)
{
    int i;
    unsigned char *p = buf;

    if (!debug)
        return;
    fprintf(stderr, "%s: ", pfx);
    for (i=0; i<len; i++)
        fprintf(stderr, "%02x ", p[i]);
    fprintf(stderr, "\n");
}
#else
#define debug(arg...)
#define print_packet(pfx, buf, len)
#endif /* DEBUG */


#define CHUNK (1024 * 1024)

/** DLOAD protocol **/

/*
 * Most of this is from Josuah Hill's DLOAD tool for iPhone
 * Some spec is also available in document 80-39912-1 Rev. E  DMSS Download Protocol Interface Specification and Operational Description
 * https://github.com/posixninja/DLOADTool/blob/master/dloadtool/dload.h
 *
 * The 0x70 switching command was found by snooping on firmware updates
 */

enum dload_cmd {
    DLOAD_ACK = 0x02, /* Acknowledge receiving a packet */
    DLOAD_NOP = 0x06, /* No operation, useful for debugging */
    DLOAD_SDP = 0x70, /* Switch to Streaming DLOAD */
};

/* 0x02 - __u8 cmd only */
/* 0x06 - __u8 cmd only */

struct dload_sdp {
    __u8 cmd; /* 0x70 */
    __u16 reserved; /* 0x0000 */
} __attribute__ ((packed));

static struct dload_sdp dload_sdp = {
    .cmd = 0x70,
    .reserved = 0,
};

/** Streaming DLOAD protocol **/

/* from GobiAPI_1.0.40/Core/QDLEnum.h and
 * GobiAPI_1.0.40/Core/QDLBuffers.h with additional details from USB
 * snooping
 */
enum qdl_cmd {
    QDL_CMD_HELLO_REQ       = 0x01, /* Hello request */
    QDL_CMD_HELLO_RSP,          /* Hello response */
    QDL_CMD_ERROR           = 0x0d, /* Error report */
    QDL_CMD_OPEN_UNFRAMED_REQ   = 0x25, /* Open unframed image write request */
    QDL_CMD_OPEN_UNFRAMED_RSP,      /* Open unframed image write response */
    QDL_CMD_WRITE_UNFRAMED_REQ,     /* Unframed image write request */
    QDL_CMD_WRITE_UNFRAMED_RSP,     /* Unframed image write response */
    QDL_CMD_SESSION_DONE_REQ,       /* Unframed session done request */
    QDL_CMD_SESSION_DONE_RSP,       /* Unframed session done response */
    QDL_CMD_DOWNLOAD_REQ,           /* Switch to download protocol request */
    QDL_CMD_SESSION_CLOSE_REQ   = 0x2d, /* Close unframed session request */
    QDL_CMD_GET_IMAGE_PREF_REQ,     /* Get image preference request */
    QDL_CMD_GET_IMAGE_PREF_RSP,     /* Get image preference response */
};

enum qdl_error {
    QDL_ERROR_01 = 1,            // 01 Reserved
    QDL_ERROR_BAD_ADDR,          // 02 Invalid destination address
    QDL_ERROR_BAD_LEN,           // 03 Invalid length
    QDL_ERROR_BAD_PACKET,        // 04 Unexpected end of packet
    QDL_ERROR_BAD_CMD,           // 05 Invalid command
    QDL_ERROR_06,                // 06 Reserved
    QDL_ERROR_OP_FAILED,         // 07 Operation failed
    QDL_ERROR_BAD_FLASH_ID,      // 08 Invalid flash intelligent ID
    QDL_ERROR_BAD_VOLTAGE,       // 09 Invalid programming voltage
    QDL_ERROR_WRITE_FAILED,      // 10 Write verify failed
    QDL_ERROR_11,                // 11 Reserved
    QDL_ERROR_BAD_SPC,           // 12 Invalid security code
    QDL_ERROR_POWERDOWN,         // 13 Power-down failed
    QDL_ERROR_UNSUPPORTED,       // 14 NAND flash programming not supported
    QDL_ERROR_CMD_SEQ,           // 15 Command out of sequence
    QDL_ERROR_CLOSE,             // 16 Close failed
    QDL_ERROR_BAD_FEATURES,      // 17 Invalid feature bits
    QDL_ERROR_SPACE,             // 18 Out of space
    QDL_ERROR_BAD_SECURITY,      // 19 Invalid security mode
    QDL_ERROR_MULTI_UNSUPPORTED, // 20 Multi-image NAND not supported
    QDL_ERROR_POWEROFF,          // 21 Power-off command not supported
    QDL_ERROR_CMD_UNSUPPORTED,   // 22 Command not supported
    QDL_ERROR_BAD_CRC,           // 23 Invalid CRC
    QDL_ERROR_STATE,             // 24 Command received in invalid state
    QDL_ERROR_TIMEOUT,           // 25 Receive timeout
    QDL_ERROR_IMAGE_AUTH,        // 26 Image authentication error
};

/* most of these origin from GobiAPI_1.0.40/Core/QDLEnum.h
 *
 * The gobi-loader's snooped magic strings use types
 *   0x05 => "amss.mbn"
 *   0x06 => "apps.mbn"
 *   0x0d => "uqcn.mbn" (Gobi 2000 only)
 *  with no file header data
 *
 * The 0x80 type is snooped from the Sierra Wireless firmware
 * uploaders, using 400 bytes file header data
 */

enum qdl_type {
    QDL_IMAGE_AMSS_MODEM        = 0x05,     // 05 AMSS modem image
    QDL_IMAGE_AMSS_APPLICATION,         // 06 AMSS application image
    QDL_IMAGE_AMSS_UQCN     = 0x0d,     // 13 Provisioning information
    QDL_IMAGE_DBL           = 0x0f,     // 15 DBL image
    QDL_IMAGE_OSBL,                 // 16 OSBL image
    QDL_IMAGE_CWE           = 0x80,     // 128 CWE image
};

static const char *qdl_type2str(__u8 type)
{
    switch (type) {
    case QDL_IMAGE_AMSS_MODEM:
        return "AMSS_MODEM";
    case QDL_IMAGE_AMSS_APPLICATION:
        return "AMSS_APPLICATION";
    case QDL_IMAGE_AMSS_UQCN:
        return "AMSS_UQCN";
    case QDL_IMAGE_DBL:
        return "DBL";
    case QDL_IMAGE_OSBL:
        return "OSBL";
    case QDL_IMAGE_CWE:
        return "CWE";
    default:
        return "UNKNOWN";
    }
}

/* feature bits */
#define QDL_FEATURE_GENERIC_UNFRAMED    0x10
#define QDL_FEATURE_QDL_UNFRAMED    0x20
#define QDL_FEATURE_BAR_MODE        0x40

struct qdl_hello_req {
    __u8 cmd; /* 0x01 */
    char magic[32];
    __u8 maxver;
    __u8 minver;
    __u8 features;
}  __attribute__ ((packed));

static struct qdl_hello_req qdl_hello_req = {
    .cmd = QDL_CMD_HELLO_REQ,
    .magic = { 'Q', 'C', 'O', 'M', ' ', 'h', 'i', 'g', 'h', ' ', 's', 'p', 'e', 'e', 'd', ' ', 'p', 'r', 'o', 't', 'o', 'c', 'o', 'l', ' ', 'h', 's', 't', },
    .maxver = 0,
    .minver = 0,
    .features = QDL_FEATURE_QDL_UNFRAMED | QDL_FEATURE_GENERIC_UNFRAMED,
};

struct qdl_hello_rsp {
    __u8 cmd; /* 0x02 */
    char magic[32];
    __u8 maxver;
    __u8 minver;
    __u32 reserved1;
    __u32 reserved2;
    __u8 reserved3;
    __u16 reserved4;
    __u16 reserved5;
    __u8 features;
}  __attribute__ ((packed));

struct qdl_err_rsp {
    __u8 cmd; /* 0x0d */
    __u32 error;
    __u8 errortxt;
}  __attribute__ ((packed));

struct qdl_ufopen_req {
    __u8 cmd; /* 0x25 */
    __u8 type;
    __u32 length;
    __u8 windowsize;
    __u32 chunksize;
    __u16 reserved;
    /* The first 400 bytes of the image is appended to the "open
     * unframed" request on Sierra Wireless modems.  This chunk is
     * not included here as it is not a part of the request.
     *
     * The file header inclusion here seems to depend on the file
     * type
     */
}  __attribute__ ((packed));

struct qdl_ufopen_rsp {
    __u8 cmd; /* 0x26 */
    __u16 status;
    __u8 windowsize;
    __u32 chunksize;
}  __attribute__ ((packed));

/* This request is not HDLC framed, so this "header" includes the crc */
struct qdl_ufwrite_req {
    __u8 cmd; /* 0x27 */
    __u16 sequence;
    __u32 reserved;
    __u32 chunksize;
    __u16 crc;
}  __attribute__ ((packed));

/* the buffer most hold a file chunk + this header */
#define BUFSIZE (CHUNK + sizeof(struct qdl_ufwrite_req))

/* The response is HDLC framed, so the crc is part of the framing */
struct qdl_ufwrite_rsp {
    __u8 cmd; /* 0x28 */
    __u16 sequence;
    __u32 reserved;
    __u16 status;
}  __attribute__ ((packed));

/* __u8 0x29 - cmd only */

struct qdl_ufclose_rsp {
    __u8 cmd; /* 0x2a */
    __u16 status;
    __u8 type;
    __u8 errortxt;
}  __attribute__ ((packed));

/* __u8 0x2d - cmd only */
/* __u8 0x2e - cmd only */

struct qdl_imagepref_rsp {
    __u8 cmd; /* 0x2f */
    __u8 entries;
    struct {
        __u8 type;
        char id[16];
    } image[];
}  __attribute__ ((packed));

/*
 * crc16 and HDLC escape code borrowed from modemmanager/libqcdm
 * Copyright (C) 2010 Red Hat, Inc.
 */

/* Table of CRCs for each possible byte, with a generator polynomial of 0x8408 */
static const __u16 crc_table[256] = {
    0x0000, 0x1189, 0x2312, 0x329b, 0x4624, 0x57ad, 0x6536, 0x74bf,
    0x8c48, 0x9dc1, 0xaf5a, 0xbed3, 0xca6c, 0xdbe5, 0xe97e, 0xf8f7,
    0x1081, 0x0108, 0x3393, 0x221a, 0x56a5, 0x472c, 0x75b7, 0x643e,
    0x9cc9, 0x8d40, 0xbfdb, 0xae52, 0xdaed, 0xcb64, 0xf9ff, 0xe876,
    0x2102, 0x308b, 0x0210, 0x1399, 0x6726, 0x76af, 0x4434, 0x55bd,
    0xad4a, 0xbcc3, 0x8e58, 0x9fd1, 0xeb6e, 0xfae7, 0xc87c, 0xd9f5,
    0x3183, 0x200a, 0x1291, 0x0318, 0x77a7, 0x662e, 0x54b5, 0x453c,
    0xbdcb, 0xac42, 0x9ed9, 0x8f50, 0xfbef, 0xea66, 0xd8fd, 0xc974,
    0x4204, 0x538d, 0x6116, 0x709f, 0x0420, 0x15a9, 0x2732, 0x36bb,
